app/controllers/products_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def show
    @product = Product.find_by(id: params["id"])

INSERT INTO "products" ("price", "title", "description", "photo_url") VALUES (?, ?, ?, ?)  [["price", 1250], ["title", "super ball"], ["description", "cool ball"], ["photo_url", "http://www.superballs.com/images/oops/SuperBall_Mini_marbled.jpg"]]
---
  def create
    p = Product.new
    p.title = params["title"]
    p.photo_url = params["photo_url"]
    p.price = params["price"].to_f * 100
    p.description = params["description"]
    p.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
UPDATE "products" SET "title" = ?, "price" = ? WHERE "products"."id" = ?  [["title", "Echo Dot2"], ["price", 20], ["id", 22]]
---
  def update
    p = Product.find_by(id: params["id"])
    p.title = params["title"]
    p.price = params["price"]
    p.description = params["description"]
    p.save

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 14]]
---
  def destroy
    p = Product.find_by(id: params["id"])
    p.destroy

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
---
  def edit
    @product = Product.find_by(id: params["id"])